Autodesk.Navisworks.Api.GridIntersection
Represents an Intersection of two Grid Lines

Autodesk.Navisworks.Api.GridIntersection.DisplayName
The display name comprising the two grid line labels and the level label.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridIntersection.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.GridIntersection.Level
The Grid Level this Intersection is on.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridIntersection.Line1
The 1st Grid Line forming this Intersection.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridIntersection.Line1Direction
The 3D direction of 1st grid line at the point of the intersection.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridIntersection.Line2
The 2nd Grid Line forming this Intersection.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridIntersection.Line2Direction
The 3D direction of 2nd grid line at the point of the intersection.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridIntersection.Position
The 3D position of the intersection.
Throws System.ObjectDisposedException:
Object has been Disposed